# utilities
brew "bat"
brew "b3sum"
brew "curl"
brew "jq"
brew "ripgrep"
brew "the_silver_searcher"
brew "tokei"
brew "tree"
brew "watchexec"
brew "wget"
brew "yq"
brew "bench"
brew "fzf"
cask "docker"

# shell
brew "reattach-to-user-namespace"
brew "starship"
brew "tmux"
brew "zsh"

# security
brew "gnupg"

# development
brew "gist"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "graphviz"
brew "imagemagick"
brew "neovim"
brew "hub"
tap "universal-ctags/universal-ctags"
brew "universal-ctags", args: ["HEAD"]
tap "homebrew/cask"
cask "chromedriver"
cask "ngrok"
cask "kitty"
cask "visual-studio-code"
brew "nvm"

# databases
brew "postgresql"
brew "sqlite"
brew "redis"

# Utilities
cask "iterm2"
cask "notion"
cask "sketch"
cask  "sizeup"
cask "google-chrome"
